/*---------------------------------------------------------------------*/
/* --- Web: www.STCAI.com ---------------------------------------------*/
/*---------------------------------------------------------------------*/

#include	"APP.h"
#include	"STC32G_WDT.h"
#include	"STC32G_GPIO.h"
#include	"STC32G_Delay.h"

/*************   功能说明   ***************

5秒后不喂狗, 等待看门狗复位.

下载时, 选择时钟 24MHz (用户可在"config.h"修改频率).

******************************************/

//========================================================================
//                               本地常量声明	
//========================================================================


//========================================================================
//                               本地变量声明
//========================================================================


//========================================================================
//                               本地函数声明
//========================================================================


//========================================================================
//                            外部函数和变量声明
//========================================================================


//========================================================================
// 函数: WDT_init
// 描述: 用户初始化程序.
// 参数: None.
// 返回: None.
// 版本: V1.0, 2020-09-28
//========================================================================
void WDT_init(void)
{
	WDT_InitTypeDef	WDT_InitStructure;					//结构定义

	WDT_InitStructure.WDT_Enable     = ENABLE;					//中断使能   ENABLE或DISABLE
	WDT_InitStructure.WDT_IDLE_Mode  = WDT_IDLE_STOP;		//IDLE模式是否停止计数		WDT_IDLE_STOP,WDT_IDLE_RUN
	WDT_InitStructure.WDT_PS         = WDT_SCALE_256;		//看门狗定时器时钟分频系数		WDT_SCALE_2,WDT_SCALE_4,WDT_SCALE_8,WDT_SCALE_16,WDT_SCALE_32,WDT_SCALE_64,WDT_SCALE_128,WDT_SCALE_256
	WDT_Inilize(&WDT_InitStructure);					//初始化
	
	RSTFLAG |= 0x04;   //设置看门狗复位需要检测P3.2的状态，否则看门狗复位后进入USB下载模式

	P4_MODE_IO_PU(GPIO_Pin_6);		//P4.6 设置为准双向口

	P46 = 0;
	delay_ms(100);
	P46 = 1;
	delay_ms(100);
	P46 = 0;
	delay_ms(100);
	P46 = 1;
	delay_ms(100);
	P46 = 0;
	delay_ms(100);
	P46 = 1;
	delay_ms(100);
	
	msecond = 0;
	second = 0;
}

//========================================================================
// 函数: Sample_WDT
// 描述: 用户应用程序.
// 参数: None.
// 返回: None.
// 版本: V1.0, 2020-09-28
//========================================================================
void Sample_WDT(void)
{
	if(second <= 5)   //5秒后不喂狗, 将复位,
		WDT_Clear();    // 喂狗

	if(++msecond >= 10)
	{
		msecond = 0;
		second++;
		P46 = !P46;
	}
}

